"use strict";
///インスタンス///
const normal = new Pokemon(
  "ノーマル",
  "なし",
  "[格闘]",
  "なし",
  "[ゴースト]",
  "なし"
);

const fire = new Pokemon(
  "炎",
  "なし",
  "[水][地面][岩]",
  "[炎][草][氷][鋼][フェアリー]",
  "なし",
  "なし"
);
const water = new Pokemon(
  "水",
  "なし",
  "[電気][草][岩]",
  "[炎][水][氷][鋼]",
  "なし",
  "なし"
);
const electric = new Pokemon(
  "電気",
  "なし",
  "[地面]",
  "[電気][飛行][鋼]",
  "なし",
  "なし"
);
const grass = new Pokemon(
  "草",
  "なし",
  "[炎][氷][毒][虫]",
  "[水][電気][草][地面]",
  "なし",
  "なし"
);
const ice = new Pokemon(
  "氷",
  "なし",
  "[炎][格闘][岩][鋼]",
  "[氷]",
  "なし",
  "なし"
);
const fighting = new Pokemon(
  "格闘",
  "なし",
  "[飛行][エスパー][フェアリー]",
  "[虫][岩][悪]",
  "なし",
  "なし"
);
const poison = new Pokemon(
  "毒",
  "なし",
  "[地面][エスパー]",
  "[草][格闘][毒][虫][フェアリー]",
  "なし",
  "なし"
);
const ground = new Pokemon(
  "地面",
  "なし",
  "[水][草][氷]",
  "[毒][岩]",
  "[電気]",
  "なし"
);
const flying = new Pokemon(
  "飛行",
  "なし",
  "[電気][氷][岩]",
  "[草][格闘][虫]",
  "[地面]",
  "なし"
);
const psychic = new Pokemon(
  "エスパー",
  "なし",
  "[虫][ゴースト][悪]",
  "[格闘][エスパー]",
  "なし",
  "なし"
);
const bug = new Pokemon(
  "虫",
  "なし",
  "[炎][飛行][岩]",
  "[草][格闘][地面]",
  "なし",
  "なし"
);
const rock = new Pokemon(
  "岩",
  "なし",
  "[水][草][格闘][地面][鋼]",
  "[ノーマル][炎][毒][飛行]",
  "なし",
  "なし"
);
const ghost = new Pokemon(
  "ゴースト",
  "なし",
  "[ゴースト][悪]",
  "[毒][虫]",
  "[ノーマル][格闘]",
  "なし"
);
const dragon = new Pokemon(
  "ドラゴン",
  "なし",
  "[氷][ドラゴン][フェアリー]",
  "[炎][水][電気][草]",
  "なし",
  "なし"
);
const dark = new Pokemon(
  "悪",
  "なし",
  "[格闘][虫][フェアリー]",
  "[ゴースト][悪]",
  "[エスパー]",
  "なし"
);
const steel = new Pokemon(
  "鋼",
  "なし",
  "[炎][格闘][地面]",
  "[ノーマル][草][氷][飛行][エスパー][虫][岩][ドラゴン][鋼][フェアリー]",
  "[毒]",
  "なし"
);
const fairy = new Pokemon(
  "フェアリー",
  "なし",
  "[毒][鋼]",
  "[格闘][虫][悪]",
  "[ドラゴン]",
  "なし"
);
